app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
SELECT COUNT(*) FROM "tasks"
---
  def index
    @tasks = Task.all
		render json: { count: @tasks.count, tasks: @tasks }, status: :ok

SELECT COUNT(*) FROM "tasks"
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."status" = ?  [["status", "To Do"]]
INSERT INTO "tasks" ("title", "description", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "Example Task 9"], ["description", "This is an example task 9."], ["status", "To Do"], ["created_at", "2024-05-08 11:41:32.807788"], ["updated_at", "2024-05-08 11:41:32.807788"]]
---
  def create
		total_tasks_count = Task.count
		todo_tasks_count = Task.where(status: 0).count

		if todo_tasks_count > total_tasks_count * 0.5
			render json: { error: "Cannot create new task. More than 50% of tasks are already in '0' status." }, status: :unprocessable_entity
			return
		end

		@task = Task.new(task_params)

		if @task.status != 0
			render json: { error: "Status must be '0' when creating a new task." }, status: :unprocessable_entity
			return
		end

		if @task.save

UPDATE "tasks" SET "description" = ?, "status" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "This is an updated example task 9."], ["status", "In Progress"], ["updated_at", "2024-05-08 11:43:39.643302"], ["id", 10]]
---
  def update
    if @task.update(task_params)

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 8]]
---
  def destroy
    @task.destroy

SELECT "tasks".* FROM "tasks"
SELECT "tasks".* FROM "tasks" WHERE "tasks"."status" = ?  [["status", 0]]
---
	def filter_by_status
		if params[:statuses].present?
			if params[:statuses] == "All"
				@tasks = Task.all
			else
				statuses = params[:statuses].split(',').map(&:strip)
				@tasks = Task.where(status: statuses)